Revit 2024 API
Wall.Flipped Property
 Property to test whether the wall orientation is flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Flipped { get; }
Visual Basic
Public ReadOnly Property Flipped As Boolean
	Get
Visual C++
public:
property bool Flipped {
	bool get ();
}
See Also
Wall Class
Autodesk.Revit.DB Namespace